# -*- ii: apisnoop; -*-
#+TITLE: Gateway API Conformance
#+AUTHOR: ii team
#+TODO: TODO(t) NEXT(n) IN-PROGRESS(i) BLOCKED(b) | DONE(d)
#+OPTIONS: toc:nil tags:nil todo:nil
#+EXPORT_SELECT_TAGS: export
#+PROPERTY: header-args:sql-mode :product postgres


* Prerequisites                                                         :export:

- https://kind.sigs.k8s.io/

#+begin_src shell
kind version
#+end_src

#+RESULTS:
#+begin_example
kind v0.22.0 go1.22.0 linux/amd64
#+end_example

* Confirm e2e audit events                                              :export:

#+begin_src shell
kubectl exec apisnoop-kind-control-plane -c snoopdb -- psql -U apisnoop -c 'select count(*) from public.audit_event;'
#+end_src

#+RESULTS:
#+begin_example
 count
--------
 601399
(1 row)

#+end_example

* Confirm live events                                                   :export:

#+begin_src shell
kubectl exec apisnoop-kind-control-plane -c snoopdb -- psql -U apisnoop -c 'select count(*) from testing.audit_event;'
#+end_src

#+RESULTS:
#+begin_example
 count
-------
 15447
(1 row)

#+end_example

* Install gateway-api crds                                              :export:

#+begin_quote
- https://gateway-api.sigs.k8s.io/guides/#installing-gateway-api
#+end_quote

#+begin_src shell
kubectl apply -f https://github.com/kubernetes-sigs/gateway-api/releases/download/v1.0.0/standard-install.yaml
#+end_src

#+RESULTS:
#+begin_example
customresourcedefinition.apiextensions.k8s.io/gatewayclasses.gateway.networking.k8s.io created
customresourcedefinition.apiextensions.k8s.io/gateways.gateway.networking.k8s.io created
customresourcedefinition.apiextensions.k8s.io/httproutes.gateway.networking.k8s.io created
customresourcedefinition.apiextensions.k8s.io/referencegrants.gateway.networking.k8s.io created
#+end_example

* List gateway-api crds                                                 :export:

#+begin_src shell
kubectl api-resources | grep gateway
#+end_src

#+RESULTS:
#+begin_example
gatewayclasses                    gc           gateway.networking.k8s.io/v1        false        GatewayClass
gateways                          gtw          gateway.networking.k8s.io/v1        true         Gateway
httproutes                                     gateway.networking.k8s.io/v1        true         HTTPRoute
referencegrants                   refgrant     gateway.networking.k8s.io/v1beta1   true         ReferenceGrant
#+end_example

